#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.2`
* Working Directory 📂`./code/data-landing-zone`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.databricks_experimentation_configuration.data.databricks_group.group[0]: Reading...[0m[0m
[0m[1mmodule.databricks_automation_configuration.data.databricks_group.group[0]: Reading...[0m[0m
[0m[1mmodule.databricks_automation_configuration.data.databricks_group.group[0]: Read complete after 1s [id=377231223141289][0m
[0m[1mmodule.databricks_experimentation_configuration.data.databricks_group.group[0]: Read complete after 1s [id=377231223141289][0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mazurerm_resource_group.shared_app_exp_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg][0m
[0m[1mmodule.databricks_automation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.shared_app_aut_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg][0m
[0m[1mmodule.datalake_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.datalake_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_experimentation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_experimentation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_automation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.databricks_automation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.runtimes_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg][0m
[0m[1mazurerm_resource_group.storage_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg][0m
[0m[1mmodule.datalake_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.management_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-mgmt-rg][0m
[0m[1mmodule.datalake_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_automation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001][0m
[0m[1mazapi_resource.devops_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001][0m
[0m[1mmodule.databricks_automation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001][0m
[0m[1mmodule.datalake_curated.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur][0m
[0m[1mmodule.datalake_enriched.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr][0m
[0m[1mmodule.databricks_experimentation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001][0m
[0m[1mmodule.datalake_workspace.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp][0m
[0m[1mmodule.datalake_raw.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw][0m
[0m[1mmodule.databricks_experimentation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.databricks_automation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.databricks_automation.data.azuread_service_principal.databricks: Read complete after 1s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.databricks_experimentation.data.azuread_service_principal.databricks: Read complete after 1s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mmodule.datalake_enriched.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_workspace.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_enriched.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/managementPolicies/default][0m
[0m[1mmodule.datalake_workspace.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/managementPolicies/default][0m
[0m[1mmodule.datalake_curated.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/managementPolicies/default][0m
[0m[1mmodule.databricks_experimentation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/1ed03e24-4a7f-e600-c1b7-2bd3cec0e000][0m
[0m[1mmodule.databricks_experimentation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/1e594bd5-96f7-75a9-9fc6-e00432cc7873][0m
[0m[1mmodule.datalake_curated.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_raw.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/managementPolicies/default][0m
[0m[1mmodule.datalake_raw.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/blobServices/default/containers/data][0m
[0m[1mmodule.databricks_automation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/1dc9ab8d-07da-f611-2050-e2293aa784b4][0m
[0m[1mmodule.databricks_automation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/7676dddf-ebc9-97f9-5d42-b1bb838c0b00][0m
[0m[1mazapi_resource.storage_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazapi_resource.runtimes_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mmodule.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstraw-blob-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_queue[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-queue-pe][0m
[0m[1mmodule.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstcur-dfs-pe][0m
[0m[1mmodule.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstenr-blob-pe][0m
[0m[1mmodule.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstcur-blob-pe][0m
[0m[1mmodule.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstenr-dfs-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-blob-pe][0m
[0m[1mmodule.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstraw-dfs-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-dfs-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_table[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-table-pe][0m
[0m[1mazapi_resource.powerbi_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint_data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-adf001-datafactory-pe][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-adf001-portal-pe][0m
[0m[1mazapi_resource.shared_app_aut_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mmodule.shir_001.random_password.password: Refreshing state... [id=none][0m
[0m[1mmodule.shir_001.data.azurerm_data_factory.data_factory: Reading...[0m[0m
[0m[1mmodule.shir_001.azurerm_lb.lb: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb][0m
[0m[1mmodule.shir_001.data.azurerm_data_factory.data_factory: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001][0m
[0m[1mmodule.shir_001.azurerm_data_factory_integration_runtime_self_hosted.data_factory_shir: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001/integrationruntimes/mydlz01-dev-shir001][0m
[0m[1mmodule.shir_001.azurerm_lb_probe.lb_probe: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/probes/mydlz01-dev-shir001-probe][0m
[0m[1mmodule.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/backendAddressPools/mydlz01-dev-shir001-backendaddresspool][0m
[0m[1mmodule.shir_001.azurerm_lb_nat_pool.lb_nat_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/inboundNatPools/mydlz01-dev-shir001-natpool][0m
[0m[1mmodule.shir_001.azurerm_lb_rule.lb_rule: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/loadBalancingRules/mydlz01-dev-shir001-rule][0m
[0m[1mazapi_resource.shared_app_exp_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-kv001-pe][0m
[0m[1mmodule.shir_001.azurerm_windows_virtual_machine_scale_set.vmss: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Compute/virtualMachineScaleSets/mydlz01-dev-shir001][0m
[0m[1mazapi_resource.databricks_private_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-kv001-pe][0m
[0m[1mazapi_resource.databricks_public_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mazapi_resource.databricks_private_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mmodule.databricks_automation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-aut-dbw001][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-blob-pe][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-uiapi-pe][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-dfs-pe][0m
[0m[1mmodule.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=E964305C0B000A13][0m
[0m[1mmodule.databricks_automation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=2325619696748532|c5af1b13-e920-4554-aff2-f509626d7d50][0m
[0m[1mmodule.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=E964305C0B000A14][0m
[0m[1mmodule.databricks_automation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mazapi_resource.databricks_public_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mmodule.databricks_experimentation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-exp-dbw001][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-dfs-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-blob-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-uiapi-pe][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=8995964093750526|c5af1b13-e920-4554-aff2-f509626d7d50][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=E964305C0B000A16][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=E964305C0B000A15][0m
[0m[1mmodule.data_products["test.yml"].time_rotating.rotation: Refreshing state... [id=2023-04-19T09:58:39Z][0m
[0m[1mmodule.data_products["test.yml"].azuread_application.application[0]: Refreshing state... [id=f40534d3-c31f-4df8-ab9d-c4c45cbf7cda][0m
[0m[1mmodule.data_products["test.yml"].azurerm_resource_group.data_product_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg][0m
[0m[1mmodule.data_products["test.yml"].azurerm_databricks_access_connector.databricks_access_connector[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Databricks/accessConnectors/test-prd-dbac001][0m
[0m[1mmodule.data_products["test.yml"].azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001][0m
[0m[1mmodule.data_products["test.yml"].azurerm_user_assigned_identity.user_assigned_identity[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/test-prd-uai001][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_security_group_display_name[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/securityGroupDisplayName][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_security_group_object_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/securityGroupObjectId][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_object_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalObjectId][0m
[0m[1mmodule.data_products["test.yml"].azuread_service_principal.service_principal[0]: Refreshing state... [id=56c1256c-3efb-4f70-8414-4d139b681e83][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_tenant_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalTenantId][0m
[0m[1mmodule.data_products["test.yml"].azuread_service_principal_password.service_principal_password[0]: Refreshing state... [id=56c1256c-3efb-4f70-8414-4d139b681e83/password/9826a6da-9e12-4919-a0ec-6c5e1cc1f676][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_client_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalClientId][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_client_secret[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalClientSecret][0m
[0m[1mmodule.data_products["test.yml"].databricks_storage_credential.automation_storage_credential[0]: Refreshing state... [id=test-prd][0m
[0m[1mmodule.data_products["test.yml"].databricks_external_location.automation_external_location[0]: Refreshing state... [id=test-prd][0m
[0m[1mmodule.data_products["test.yml"].databricks_catalog.automation_catalog[0]: Refreshing state... [id=test-prd][0m
[0m[1mmodule.data_products["test.yml"].databricks_grants.grants_automation_catalog[0]: Refreshing state... [id=catalog/test-prd][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_products["test.yml"].data.azuread_client_config.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azuread_client_config" "current" {
      [32m+[0m[0m client_id = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m object_id = (known after apply)
      [32m+[0m[0m tenant_id = (known after apply)
    }

[1m  # module.data_products["test.yml"].data.azuread_group.security_group[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azuread_group" "security_group" {
      [32m+[0m[0m assignable_to_role             = (known after apply)
      [32m+[0m[0m auto_subscribe_new_members     = (known after apply)
      [32m+[0m[0m behaviors                      = (known after apply)
      [32m+[0m[0m description                    = (known after apply)
      [32m+[0m[0m display_name                   = "test"
      [32m+[0m[0m dynamic_membership             = (known after apply)
      [32m+[0m[0m external_senders_allowed       = (known after apply)
      [32m+[0m[0m hide_from_address_lists        = (known after apply)
      [32m+[0m[0m hide_from_outlook_clients      = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m mail                           = (known after apply)
      [32m+[0m[0m mail_enabled                   = (known after apply)
      [32m+[0m[0m mail_nickname                  = (known after apply)
      [32m+[0m[0m members                        = (known after apply)
      [32m+[0m[0m object_id                      = (known after apply)
      [32m+[0m[0m onpremises_domain_name         = (known after apply)
      [32m+[0m[0m onpremises_group_type          = (known after apply)
      [32m+[0m[0m onpremises_netbios_name        = (known after apply)
      [32m+[0m[0m onpremises_sam_account_name    = (known after apply)
      [32m+[0m[0m onpremises_security_identifier = (known after apply)
      [32m+[0m[0m onpremises_sync_enabled        = (known after apply)
      [32m+[0m[0m owners                         = (known after apply)
      [32m+[0m[0m preferred_language             = (known after apply)
      [32m+[0m[0m provisioning_options           = (known after apply)
      [32m+[0m[0m proxy_addresses                = (known after apply)
      [32m+[0m[0m security_enabled               = true
      [32m+[0m[0m theme                          = (known after apply)
      [32m+[0m[0m types                          = (known after apply)
      [32m+[0m[0m visibility                     = (known after apply)
      [32m+[0m[0m writeback_enabled              = (known after apply)
    }

[1m  # module.data_products["test.yml"].data.azurerm_client_config.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_client_config" "current" {
      [32m+[0m[0m client_id       = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m object_id       = (known after apply)
      [32m+[0m[0m subscription_id = (known after apply)
      [32m+[0m[0m tenant_id       = (known after apply)
    }

[1m  # module.data_products["test.yml"].data.azurerm_network_security_group.network_security_group[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_network_security_group" "network_security_group" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = (known after apply)
      [32m+[0m[0m name                = "mycrp-prd-dlz01-nsg001"
      [32m+[0m[0m resource_group_name = "mycrp-prd-dlz01-network-rg"
      [32m+[0m[0m security_rule       = (known after apply)
      [32m+[0m[0m tags                = (known after apply)
    }

[1m  # module.data_products["test.yml"].data.azurerm_route_table.route_table[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_route_table" "route_table" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = (known after apply)
      [32m+[0m[0m name                = "mycrp-prd-dlz01-rt001"
      [32m+[0m[0m resource_group_name = "mycrp-prd-dlz01-network-rg"
      [32m+[0m[0m route               = (known after apply)
      [32m+[0m[0m subnets             = (known after apply)
      [32m+[0m[0m tags                = (known after apply)
    }

[1m  # module.data_products["test.yml"].data.azurerm_storage_account.datalake_curated[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_storage_account" "datalake_curated" {
      [32m+[0m[0m access_tier                       = (known after apply)
      [32m+[0m[0m account_kind                      = (known after apply)
      [32m+[0m[0m account_replication_type          = (known after apply)
      [32m+[0m[0m account_tier                      = (known after apply)
      [32m+[0m[0m allow_nested_items_to_be_public   = (known after apply)
      [32m+[0m[0m azure_files_authentication        = (known after apply)
      [32m+[0m[0m custom_domain                     = (known after apply)
      [32m+[0m[0m enable_https_traffic_only         = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m identity                          = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = (known after apply)
      [32m+[0m[0m is_hns_enabled                    = (known after apply)
      [32m+[0m[0m location                          = (known after apply)
      [32m+[0m[0m name                              = "mydlz01devstcur"
      [32m+[0m[0m nfsv3_enabled                     = (known after apply)
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m queue_encryption_key_type         = (known after apply)
      [32m+[0m[0m resource_group_name               = "mydlz01-dev-storage-rg"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m table_encryption_key_type         = (known after apply)
      [32m+[0m[0m tags                              = (known after apply)
    }

[1m  # module.data_products["test.yml"].data.azurerm_storage_account.datalake_enriched[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_storage_account" "datalake_enriched" {
      [32m+[0m[0m access_tier                       = (known after apply)
      [32m+[0m[0m account_kind                      = (known after apply)
      [32m+[0m[0m account_replication_type          = (known after apply)
      [32m+[0m[0m account_tier                      = (known after apply)
      [32m+[0m[0m allow_nested_items_to_be_public   = (known after apply)
      [32m+[0m[0m azure_files_authentication        = (known after apply)
      [32m+[0m[0m custom_domain                     = (known after apply)
      [32m+[0m[0m enable_https_traffic_only         = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m identity                          = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = (known after apply)
      [32m+[0m[0m is_hns_enabled                    = (known after apply)
      [32m+[0m[0m location                          = (known after apply)
      [32m+[0m[0m name                              = "mydlz01devstenr"
      [32m+[0m[0m nfsv3_enabled                     = (known after apply)
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m queue_encryption_key_type         = (known after apply)
      [32m+[0m[0m resource_group_name               = "mydlz01-dev-storage-rg"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m table_encryption_key_type         = (known after apply)
      [32m+[0m[0m tags                              = (known after apply)
    }

[1m  # module.data_products["test.yml"].data.azurerm_storage_account.datalake_raw[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_storage_account" "datalake_raw" {
      [32m+[0m[0m access_tier                       = (known after apply)
      [32m+[0m[0m account_kind                      = (known after apply)
      [32m+[0m[0m account_replication_type          = (known after apply)
      [32m+[0m[0m account_tier                      = (known after apply)
      [32m+[0m[0m allow_nested_items_to_be_public   = (known after apply)
      [32m+[0m[0m azure_files_authentication        = (known after apply)
      [32m+[0m[0m custom_domain                     = (known after apply)
      [32m+[0m[0m enable_https_traffic_only         = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m identity                          = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = (known after apply)
      [32m+[0m[0m is_hns_enabled                    = (known after apply)
      [32m+[0m[0m location                          = (known after apply)
      [32m+[0m[0m name                              = "mydlz01devstraw"
      [32m+[0m[0m nfsv3_enabled                     = (known after apply)
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m queue_encryption_key_type         = (known after apply)
      [32m+[0m[0m resource_group_name               = "mydlz01-dev-storage-rg"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m table_encryption_key_type         = (known after apply)
      [32m+[0m[0m tags                              = (known after apply)
    }

[1m  # module.data_products["test.yml"].data.azurerm_storage_account.datalake_workspace[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_storage_account" "datalake_workspace" {
      [32m+[0m[0m access_tier                       = (known after apply)
      [32m+[0m[0m account_kind                      = (known after apply)
      [32m+[0m[0m account_replication_type          = (known after apply)
      [32m+[0m[0m account_tier                      = (known after apply)
      [32m+[0m[0m allow_nested_items_to_be_public   = (known after apply)
      [32m+[0m[0m azure_files_authentication        = (known after apply)
      [32m+[0m[0m custom_domain                     = (known after apply)
      [32m+[0m[0m enable_https_traffic_only         = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m identity                          = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = (known after apply)
      [32m+[0m[0m is_hns_enabled                    = (known after apply)
      [32m+[0m[0m location                          = (known after apply)
      [32m+[0m[0m name                              = "mydlz01devstwsp"
      [32m+[0m[0m nfsv3_enabled                     = (known after apply)
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m queue_encryption_key_type         = (known after apply)
      [32m+[0m[0m resource_group_name               = "mydlz01-dev-storage-rg"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m table_encryption_key_type         = (known after apply)
      [32m+[0m[0m tags                              = (known after apply)
    }

[1m  # module.data_products["test.yml"].data.azurerm_virtual_network.virtual_network[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_virtual_network" "virtual_network" {
      [32m+[0m[0m address_space           = (known after apply)
      [32m+[0m[0m dns_servers             = (known after apply)
      [32m+[0m[0m guid                    = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m location                = (known after apply)
      [32m+[0m[0m name                    = "mycrp-prd-dlz01-vnet001"
      [32m+[0m[0m resource_group_name     = "mycrp-prd-dlz01-network-rg"
      [32m+[0m[0m subnets                 = (known after apply)
      [32m+[0m[0m tags                    = (known after apply)
      [32m+[0m[0m vnet_peerings           = (known after apply)
      [32m+[0m[0m vnet_peerings_addresses = (known after apply)
    }

[1m  # module.data_products["test.yml"].azapi_resource.container_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "container_workspace" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m metadata     = {}
                  [32m+[0m[0m publicAccess = "None"
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "test-prd"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = (known after apply)
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Storage/storageAccounts/blobServices/containers@2022-09-01"
    }

[1m  # module.data_products["test.yml"].azapi_resource.key_vault_secret_security_group_object_id[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_resource" "key_vault_secret_security_group_object_id" {
      [33m~[0m[0m body                      = jsonencode(
            {
              [31m-[0m[0m properties = {
                  [31m-[0m[0m attributes  = {
                      [31m-[0m[0m enabled = true
                    }
                  [31m-[0m[0m contentType = "text/plain"
                  [31m-[0m[0m value       = "238f1be3-8722-41ab-ac00-0ac9b8703915"
                }
            }
        ) -> (known after apply)
        id                        = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/securityGroupObjectId"
        name                      = "securityGroupObjectId"
      [33m~[0m[0m output                    = jsonencode({}) -> (known after apply)
        tags                      = {}
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_products["test.yml"].azapi_resource.subnet[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet" {
      [32m+[0m[0m body                      = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "DataProductSubnet-test-prd"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = (known after apply)
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_products["test.yml"].azuread_application.application[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azuread_application" "application" {
        id                             = "f40534d3-c31f-4df8-ab9d-c4c45cbf7cda"
      [33m~[0m[0m owners                         = [
          [31m-[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be",
        ] -> (known after apply)
        tags                           = []
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (6 unchanged blocks hidden)[0m[0m
    }

[1m  # module.data_products["test.yml"].azuread_group_member.security_group_dbac_member[0][0m will be created
[0m  [32m+[0m[0m resource "azuread_group_member" "security_group_dbac_member" {
      [32m+[0m[0m group_object_id  = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m member_object_id = "6d2bf5cb-0c4b-4b1c-a696-1bf0ad88fb90"
    }

[1m  # module.data_products["test.yml"].azuread_group_member.security_group_sp_member[0][0m will be created
[0m  [32m+[0m[0m resource "azuread_group_member" "security_group_sp_member" {
      [32m+[0m[0m group_object_id  = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m member_object_id = "56c1256c-3efb-4f70-8414-4d139b681e83"
    }

[1m  # module.data_products["test.yml"].azuread_group_member.security_group_uai_member[0][0m will be created
[0m  [32m+[0m[0m resource "azuread_group_member" "security_group_uai_member" {
      [32m+[0m[0m group_object_id  = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m member_object_id = "4a38ae94-6ff3-45c9-bfb4-ec756fdfcd5d"
    }

[1m  # module.data_products["test.yml"].azuread_service_principal.service_principal[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azuread_service_principal" "service_principal" {
        id                           = "56c1256c-3efb-4f70-8414-4d139b681e83"
      [33m~[0m[0m owners                       = [
          [31m-[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be",
        ] -> (known after apply)
        tags                         = []
        [90m# (18 unchanged attributes hidden)[0m[0m

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # module.data_products["test.yml"].azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001"
        name                            = "test-prd-vault001"
        tags                            = {
            "costCenter" = "ABCD1234"
        }
      [33m~[0m[0m tenant_id                       = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e" -> (known after apply)
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.data_products["test.yml"].azurerm_private_endpoint.key_vault_private_endpoint[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "test-prd-vault001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "test-prd-vault001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "test-prd-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "costCenter" = "ABCD1234"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "test-prd-vault001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "test-prd-vault001-pe"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_container_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_container_workspace" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_resource_group[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_resource_group" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Contributor"
      [32m+[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_storage_workspace[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_storage_workspace" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Delegator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_subnet[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_subnet" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Network Contributor"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.databricks_automation_configuration.databricks_secret_acl.secret_acl[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "MANAGE"
      [32m+[0m[0m principal  = "test"
      [32m+[0m[0m scope      = "platform-secret-scope"
    }

[1m  # module.databricks_experimentation_configuration.databricks_secret_acl.secret_acl[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_secret_acl" "secret_acl" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m permission = "MANAGE"
      [32m+[0m[0m principal  = "test"
      [32m+[0m[0m scope      = "platform-secret-scope"
    }

[1mPlan:[0m 12 to add, 4 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>